; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	satellite7 - satellite
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	satellite8 - satellite
	instrument19 - instrument
	instrument20 - instrument
	instrument21 - instrument
	satellite9 - satellite
	instrument22 - instrument
	instrument23 - instrument
	instrument24 - instrument
	spectrograph2 - mode
	spectrograph1 - mode
	infrared0 - mode
	GroundStation3 - direction
	Star1 - direction
	GroundStation2 - direction
	Star5 - direction
	Star4 - direction
	Star0 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 spectrograph2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star4)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 spectrograph1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star5)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument8 infrared0)
	(supports instrument8 spectrograph2)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 spectrograph1)
	(supports instrument9 infrared0)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 Star5)
	(supports instrument10 infrared0)
	(supports instrument10 spectrograph2)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation2)
	(calibration_target instrument10 Star1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 Star0)
	(calibration_target instrument11 Star1)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 GroundStation3)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation3)
	(supports instrument13 infrared0)
	(supports instrument13 spectrograph1)
	(supports instrument13 spectrograph2)
	(calibration_target instrument13 Star1)
	(supports instrument14 spectrograph1)
	(calibration_target instrument14 Star4)
	(supports instrument15 infrared0)
	(supports instrument15 spectrograph1)
	(calibration_target instrument15 Star5)
	(calibration_target instrument15 Star1)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet9)
	(supports instrument16 infrared0)
	(calibration_target instrument16 Star5)
	(calibration_target instrument16 Star4)
	(supports instrument17 spectrograph1)
	(calibration_target instrument17 GroundStation2)
	(calibration_target instrument17 Star4)
	(supports instrument18 spectrograph2)
	(supports instrument18 infrared0)
	(calibration_target instrument18 Star4)
	(on_board instrument16 satellite7)
	(on_board instrument17 satellite7)
	(on_board instrument18 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet8)
	(supports instrument19 infrared0)
	(supports instrument19 spectrograph2)
	(calibration_target instrument19 GroundStation2)
	(supports instrument20 infrared0)
	(calibration_target instrument20 Star4)
	(supports instrument21 spectrograph1)
	(supports instrument21 infrared0)
	(calibration_target instrument21 Star4)
	(calibration_target instrument21 Star5)
	(on_board instrument19 satellite8)
	(on_board instrument20 satellite8)
	(on_board instrument21 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Star1)
	(supports instrument22 spectrograph2)
	(calibration_target instrument22 Star4)
	(calibration_target instrument22 Star5)
	(supports instrument23 spectrograph2)
	(supports instrument23 infrared0)
	(calibration_target instrument23 Star0)
	(calibration_target instrument23 Star4)
	(supports instrument24 infrared0)
	(supports instrument24 spectrograph1)
	(calibration_target instrument24 Star0)
	(on_board instrument22 satellite9)
	(on_board instrument23 satellite9)
	(on_board instrument24 satellite9)
	(power_avail satellite9)
	(pointing satellite9 Phenomenon7)
)
(:goal (and
	(pointing satellite0 Phenomenon11)
	(pointing satellite4 Planet8)
	(pointing satellite6 Phenomenon7)
	(pointing satellite9 Planet9)
	(have_image Star6 spectrograph1)
	(have_image Phenomenon7 infrared0)
	(have_image Planet8 infrared0)
	(have_image Planet9 spectrograph2)
	(have_image Phenomenon10 spectrograph1)
	(have_image Phenomenon11 spectrograph2)
))

)

; plan
1. (turn_to satellite4 planet8 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 planet8)
   goals met: 1 of 10
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 10
3. (calibrate satellite2 instrument5 star5)
   added: (calibrated instrument5)
   goals met: 1 of 10
4. (turn_to satellite2 planet8 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 planet8)
   goals met: 1 of 10
5. (take_image satellite2 planet8 instrument5 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 2 of 10
6. (turn_to satellite2 phenomenon7 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 10
7. (take_image satellite2 phenomenon7 instrument5 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 3 of 10
8. (turn_to satellite2 phenomenon11 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 10
9. (take_image satellite2 phenomenon11 instrument5 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 4 of 10
10. (turn_to satellite2 phenomenon10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon10)
   goals met: 4 of 10
11. (turn_to satellite0 phenomenon11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 10
12. (take_image satellite2 phenomenon10 instrument5 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 6 of 10
13. (turn_to satellite2 planet9 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet9)
   goals met: 6 of 10
14. (take_image satellite2 planet9 instrument5 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 7 of 10
15. (turn_to satellite2 star6 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star6)
   goals met: 7 of 10
16. (take_image satellite2 star6 instrument5 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 8 of 10
17. (turn_to satellite6 phenomenon7 planet9)
   deleted: (pointing satellite6 planet9)
   added: (pointing satellite6 phenomenon7)
   goals met: 9 of 10
18. (turn_to satellite9 planet9 phenomenon7)
   deleted: (pointing satellite9 phenomenon7)
   added: (pointing satellite9 planet9)
   goals met: 10 of 10
